<a href="https://colab.research.google.com/github/UznetDev/Data-science-home-work/blob/main/26_Avg_2024.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **SQL**

### Import librares

In [2]:
import pandas as pd

### Set-up for SQL

In [3]:
%load_ext sql
%sql sqlite://

##### Load dataset

In [4]:
monarchs = pd.read_csv('monarchs.csv')
presidents = pd.read_csv('presidents.csv')
prime_minister_terms = pd.read_csv('prime_minister_terms.csv')
prime_ministers = pd.read_csv('prime_ministers.csv')
states = pd.read_csv('states.csv')

##### Upload dataset to SQL

In [5]:
%sql DROP TABLE IF EXISTS monarchs;
%sql --persist monarchs

%sql DROP TABLE IF EXISTS presidents;
%sql --persist presidents

%sql DROP TABLE IF EXISTS prime_minister_terms;
%sql --persist prime_minister_terms

%sql DROP TABLE IF EXISTS prime_ministers;
%sql --persist prime_ministers

%sql DROP TABLE IF EXISTS states;
%sql --persist states

 * sqlite://
Done.
 * sqlite://
 * sqlite://
Done.
 * sqlite://
 * sqlite://
Done.
 * sqlite://
 * sqlite://
Done.
 * sqlite://
 * sqlite://
Done.
 * sqlite://

'Persisted states'

### Class work

#### Part 1

##### View all table

In [7]:
%%sql SELECT * FROM monarchs LIMIT 1;

 * sqlite://
Done.

[(0, 'Brunei', 'Asia', 'Hassanal Bolkiah')]

In [8]:
%%sql SELECT * FROM presidents LIMIT 1;

 * sqlite://
Done.

[(0, 'Egypt', 'Africa', 'Abdel Fattah el-Sisi')]

In [9]:
%%sql SELECT * FROM prime_minister_terms LIMIT 1;

 * sqlite://
Done.

[(0, 'Mostafa Madbouly', 2018)]

In [10]:
%%sql SELECT * FROM prime_ministers LIMIT 1;

 * sqlite://
Done.

[(0, 'Egypt', 'Africa', 'Mostafa Madbouly')]

In [11]:
%%sql SELECT * FROM states LIMIT 1;

 * sqlite://
Done.

[(0, 'Australia', 'Oceania', 1901)]

##### CASE

In [29]:
%%sql
SELECT country,
       CASE
           WHEN indep_year < 1800 THEN 'Before 1800'
           WHEN indep_year BETWEEN 1800 AND 1850 THEN 'Between 1800 and 1850'
           ELSE 'After 1850'
       END AS independence_period
FROM states;

 * sqlite://
Done.

[('Australia', 'After 1850'),
 ('Brunei', 'After 1850'),
 ('Chile', 'Between 1800 and 1850'),
 ('Egypt', 'After 1850'),
 ('India', 'After 1850'),
 ('Norway', 'After 1850'),
 ('Oman', 'After 1850'),
 ('Pakistan', 'After 1850'),
 ('Portugal', 'Before 1800'),
 ('Uruguay', 'Between 1800 and 1850'),
 ('USA', 'Before 1800')]

In [34]:
%%sql
SELECT country,
       CASE
           WHEN indep_year < 1950 THEN 'Before 1950'
           ELSE 'After 1950'
       END AS independence_period
FROM states;

 * sqlite://
Done.

[('Australia', 'Before 1950'),
 ('Brunei', 'After 1950'),
 ('Chile', 'Before 1950'),
 ('Egypt', 'Before 1950'),
 ('India', 'Before 1950'),
 ('Norway', 'Before 1950'),
 ('Oman', 'After 1950'),
 ('Pakistan', 'Before 1950'),
 ('Portugal', 'Before 1950'),
 ('Uruguay', 'Before 1950'),
 ('USA', 'Before 1950')]

In [44]:
%%sql SELECT p.continent,
       COUNT(s.country) AS number_of_states,
      CASE
          WHEN COUNT(s.country) < 10 THEN 'small'
          WHEN COUNT(s.country) BETWEEN 10 AND 20 THEN 'medium'
          ELSE 'big'
      END AS size
FROM states AS s
INNER JOIN presidents AS p
ON s.country = p.country
LEFT JOIN prime_ministers AS pm
ON p.country = pm.country
LEFT JOIN monarchs AS m
ON p.country = m.country
GROUP BY p.continent;

 * sqlite://
Done.

[('Africa', 1, 'small'),
 ('Asia', 2, 'small'),
 ('Europe', 1, 'small'),
 ('North America', 1, 'small'),
 ('South America', 2, 'small')]

In [47]:
%%sql SELECT country, prime_minister,
             CASE
                 WHEN pm_start < 2000 THEN 'Before 2000'
                 ELSE 'After 2000'
             END AS period
FROM prime_minister_terms
LEFT JOIN prime_ministers
USING (prime_minister);

 * sqlite://
Done.

[('Egypt', 'Mostafa Madbouly', 'After 2000'),
 ('Portugal', 'António Costa', 'After 2000'),
 ('Pakistan', 'Shehbaz Sharif', 'After 2000'),
 ('United Kingdom', 'Boris Johnson', 'After 2000'),
 ('India', 'Narendra Modi', 'After 2000'),
 ('Australia', 'Scott Morrison', 'After 2000'),
 ('Norway', 'Jonas Gahr Støre', 'After 2000'),
 ('Brunei', 'Hassanal Bolkiah', 'Before 2000'),
 ('Oman', 'Haitham bin Tarik', 'After 2000'),
 ('New Zealand', 'Jacinda Ardern', 'After 2000')]

In [50]:
%%sql SELECT country, indep_year
FROM states
WHERE
     CASE
         WHEN indep_year < 1800
         OR indep_year > 1900
         THEN 1
         ELSE 0
     END;

 * sqlite://
Done.

[('Australia', 1901),
 ('Brunei', 1984),
 ('Egypt', 1922),
 ('India', 1947),
 ('Norway', 1905),
 ('Oman', 1951),
 ('Pakistan', 1947),
 ('Portugal', 1143),
 ('USA', 1776)]

In [52]:
%%sql SELECT country,
       CASE
           WHEN president IS NOT NULL THEN 'Yes'
           ELSE 'No'
       END AS president,
       CASE
           WHEN prime_minister IS NOT NULL THEN 'Yes'
           ELSE 'No'
       END AS prime_minister,
       CASE
           WHEN monarch IS NOT NULL THEN 'Yes'
           ELSE 'No'
       END AS monarch
FROM states
LEFT JOIN presidents
USING (country)
LEFT JOIN prime_ministers
USING (country)
LEFT JOIN monarchs
USING (country);

 * sqlite://
Done.

[('Australia', 'No', 'Yes', 'No'),
 ('Brunei', 'No', 'Yes', 'Yes'),
 ('Chile', 'Yes', 'No', 'No'),
 ('Egypt', 'Yes', 'Yes', 'No'),
 ('India', 'Yes', 'Yes', 'No'),
 ('Norway', 'No', 'Yes', 'Yes'),
 ('Oman', 'No', 'Yes', 'Yes'),
 ('Pakistan', 'Yes', 'Yes', 'No'),
 ('Portugal', 'Yes', 'Yes', 'No'),
 ('Uruguay', 'Yes', 'No', 'No'),
 ('USA', 'Yes', 'No', 'No')]

In [57]:
%%sql SELECT country,
       CASE
           WHEN (SELECT COUNT(*)
                 FROM presidents AS p
                 WHERE p.country = s.country) THEN 'Yes'
           ELSE 'No'
       END AS president,
       CASE
           WHEN (SELECT COUNT(*)
                 FROM prime_ministers AS p
                 WHERE p.country = s.country) THEN 'Yes'
           ELSE 'No'
       END AS prime_minister
FROM states AS s;

 * sqlite://
Done.

[('Australia', 'No', 'Yes'),
 ('Brunei', 'No', 'Yes'),
 ('Chile', 'Yes', 'No'),
 ('Egypt', 'Yes', 'Yes'),
 ('India', 'Yes', 'Yes'),
 ('Norway', 'No', 'Yes'),
 ('Oman', 'No', 'Yes'),
 ('Pakistan', 'Yes', 'Yes'),
 ('Portugal', 'Yes', 'Yes'),
 ('Uruguay', 'Yes', 'No'),
 ('USA', 'Yes', 'No')]

In [61]:
%%sql SELECT country,
       CASE
           WHEN country IN (SELECT p.country
                            FROM presidents AS p
                            WHERE p.country = s.country) THEN 'Yes'
           ELSE 'No'
       END AS president,
       CASE
           WHEN country IN (SELECT p.country
                 FROM prime_ministers AS p
                 WHERE p.country = s.country) THEN 'Yes'
           ELSE 'No'
       END AS prime_minister
FROM states AS s;

 * sqlite://
Done.

[('Australia', 'No', 'Yes'),
 ('Brunei', 'No', 'Yes'),
 ('Chile', 'Yes', 'No'),
 ('Egypt', 'Yes', 'Yes'),
 ('India', 'Yes', 'Yes'),
 ('Norway', 'No', 'Yes'),
 ('Oman', 'No', 'Yes'),
 ('Pakistan', 'Yes', 'Yes'),
 ('Portugal', 'Yes', 'Yes'),
 ('Uruguay', 'Yes', 'No'),
 ('USA', 'Yes', 'No')]